{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_19",
            "layers": [
                {
                    "class_name": "Sequential",
                    "config": {
                        "name": "sequential_16",
                        "layers": [
                            {
                                "class_name": "Model",
                                "config": {
                                    "name": "model5",
                                    "layers": [
                                        {
                                            "name": "input_1",
                                            "class_name": "InputLayer",
                                            "config": {
                                                "batch_input_shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float32",
                                                "sparse": false,
                                                "name": "input_1"
                                            },
                                            "inbound_nodes": []
                                        },
                                        {
                                            "name": "Conv1_pad",
                                            "class_name": "ZeroPadding2D",
                                            "config": {
                                                "padding": [
                                                    [
                                                        0,
                                                        1
                                                    ],
                                                    [
                                                        0,
                                                        1
                                                    ]
                                                ],
                                                "data_format": "channels_last",
                                                "name": "Conv1_pad",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "input_1",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "Conv1",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 16,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    3,
                                                    3
                                                ],
                                                "strides": [
                                                    2,
                                                    2
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "Conv1",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "Conv1_pad",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "bn_Conv1",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": -1,
                                                "momentum": 0.999,
                                                "epsilon": 0.001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "bn_Conv1",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "Conv1",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "Conv1_relu",
                                            "class_name": "ReLU",
                                            "config": {
                                                "max_value": 6,
                                                "name": "Conv1_relu",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "bn_Conv1",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "expanded_conv_depthwise",
                                            "class_name": "DepthwiseConv2D",
                                            "config": {
                                                "kernel_size": [
                                                    3,
                                                    3
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "same",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "expanded_conv_depthwise",
                                                "trainable": true,
                                                "depth_multiplier": 1,
                                                "depthwise_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "depthwise_regularizer": null,
                                                "depthwise_constraint": null
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "Conv1_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "expanded_conv_depthwise_BN",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": -1,
                                                "momentum": 0.999,
                                                "epsilon": 0.001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "expanded_conv_depthwise_BN",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "expanded_conv_depthwise",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "expanded_conv_depthwise_relu",
                                            "class_name": "ReLU",
                                            "config": {
                                                "max_value": 6,
                                                "name": "expanded_conv_depthwise_relu",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "expanded_conv_depthwise_BN",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "expanded_conv_project",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 8,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "same",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "expanded_conv_project",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "expanded_conv_depthwise_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "expanded_conv_project_BN",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": -1,
                                                "momentum": 0.999,
                                                "epsilon": 0.001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "expanded_conv_project_BN",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "expanded_conv_project",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_expand",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 48,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "same",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "block_1_expand",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "expanded_conv_project_BN",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_expand_BN",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": -1,
                                                "momentum": 0.999,
                                                "epsilon": 0.001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "block_1_expand_BN",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_expand",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_expand_relu",
                                            "class_name": "ReLU",
                                            "config": {
                                                "max_value": 6,
                                                "name": "block_1_expand_relu",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_expand_BN",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_pad",
                                            "class_name": "ZeroPadding2D",
                                            "config": {
                                                "padding": [
                                                    [
                                                        0,
                                                        1
                                                    ],
                                                    [
                                                        0,
                                                        1
                                                    ]
                                                ],
                                                "data_format": "channels_last",
                                                "name": "block_1_pad",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_expand_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_depthwise",
                                            "class_name": "DepthwiseConv2D",
                                            "config": {
                                                "kernel_size": [
                                                    3,
                                                    3
                                                ],
                                                "strides": [
                                                    2,
                                                    2
                                                ],
                                                "padding": "valid",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "block_1_depthwise",
                                                "trainable": true,
                                                "depth_multiplier": 1,
                                                "depthwise_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "depthwise_regularizer": null,
                                                "depthwise_constraint": null
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_pad",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_depthwise_BN",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": -1,
                                                "momentum": 0.999,
                                                "epsilon": 0.001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "block_1_depthwise_BN",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_depthwise",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_depthwise_relu",
                                            "class_name": "ReLU",
                                            "config": {
                                                "max_value": 6,
                                                "name": "block_1_depthwise_relu",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_depthwise_BN",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_project",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 8,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "same",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "block_1_project",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_depthwise_relu",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_1_project_BN",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": -1,
                                                "momentum": 0.999,
                                                "epsilon": 0.001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "moving_mean_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "moving_variance_initializer": {
                                                    "class_name": "Ones",
                                                    "config": {}
                                                },
                                                "beta_regularizer": null,
                                                "gamma_regularizer": null,
                                                "beta_constraint": null,
                                                "gamma_constraint": null,
                                                "name": "block_1_project_BN",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_project",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_2_expand",
                                            "class_name": "Conv2D",
                                            "config": {
                                                "filters": 48,
                                                "kernel_initializer": {
                                                    "class_name": "VarianceScaling",
                                                    "config": {
                                                        "scale": 1,
                                                        "mode": "fan_avg",
                                                        "distribution": "uniform",
                                                        "seed": null
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "kernel_constraint": null,
                                                "kernel_size": [
                                                    1,
                                                    1
                                                ],
                                                "strides": [
                                                    1,
                                                    1
                                                ],
                                                "padding": "same",
                                                "data_format": "channels_last",
                                                "dilation_rate": [
                                                    1,
                                                    1
                                                ],
                                                "activation": "linear",
                                                "use_bias": false,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "bias_regularizer": null,
                                                "activity_regularizer": null,
                                                "bias_constraint": null,
                                                "name": "block_2_expand",
                                                "trainable": true
                                            },
                                            "inbound_nodes": [
                                                [
                                                    [
                                                        "block_1_project_BN",
                                                        0,
                                                        0,
                                                        {}
                                                    ]
                                                ]
                                            ]
                                        },
                                        {
                                            "name": "block_2_expand_BN",
                                            "class_name": "BatchNormalization",
                                            "config": {
                                                "axis": -1,
                                                "momentum": 0.999,
                                                "epsilon": 0.001,
                                                "center": true,
                                                "scale": true,
                                                "beta_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {}
                                                },
                                                "gamma_initializer": {
                                                    "class_name": "Ones",
